

# 切片

maps = ['北京', '上海', '广州', '深圳', '杭州', '成都', '武汉', '西安', '重庆', '南京']
print(maps[0:3])  # ['北京', '上海', '广州']

print(maps[2:5])  #

print(maps[1:8:2])  # ['成都', '武汉', '西安']

maps.sort()
print(maps)


###################################################################

maps = [32, 45, 67, 89, 12, 34, 56, 78, 90, 23]

print(maps[::2])  # [32, 67, 12, 56, 90]
print(maps[::-1])  # [23, 90, 78, 56, 34, 12, 89, 67, 45, 32]
print(maps[::-2])  # [23, 78, 34, 67, 32]
print(maps[::3])  # [32, 89, 56, 23]

maps.append(100) # 追加
print(maps)  # [32, 45, 67, 89, 12, 34, 56, 78, 90, 23, 100]

maps.insert(0, 1000)  # 插入
print(maps)  # [1000, 32, 45, 67, 89, 12, 34, 56, 78, 90, 23, 100]

maps.pop()  # 删除最后一个
print(maps)  # [1000, 32, 45, 67, 89, 12, 34, 56, 78, 90, 23]

pop_number = maps.pop(0)  # 删除指定位置
print(maps)  # [32, 45, 67, 89, 12, 34, 56, 78, 90, 23]
print(pop_number)  # 1000

maps.sort() # 排序
print(maps)  # [12, 23, 32, 34, 45, 56, 67, 78, 89, 90]

maps.reverse() # 反转
print(maps)  # [90, 89, 78, 67, 56, 45, 34, 32, 23, 12]
